<a href="https://colab.research.google.com/github/hanna-joo/bigdata_edu/blob/master/python_edu/pandas_basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

# 1. 변수 생성 (Object creation)

In [ ]:
# Series 생성
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [ ]:
# DataFrame 생성: Numpy 행렬
dates = pd.date_range('20130101',periods=6)
print(dates)
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

                   A         B         C         D
2013-01-01  0.680374  0.517372 -1.671865 -0.974822
2013-01-02  1.016652 -1.274628 -0.977082 -0.731951
2013-01-03  0.061942 -0.762119 -1.454836  0.457252
2013-01-04 -0.717764  1.754018 -0.322983  0.132655
2013-01-05  1.127538 -0.861880  1.026014  1.636723
2013-01-06 -1.449656  2.067481  1.412776 -0.638622

In [ ]:
# DataFrame 생성: 딕셔너리
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3]*4, dtype='int32'),
                    'E': pd.Categorical(['test','train','test','train']),
                    'F': 'foo'})
print(df2.dtypes)
df2

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

# 2. 데이터 확인 (Viewing data)

In [ ]:
df.head(2)

                   A         B         C         D
2013-01-01  0.680374  0.517372 -1.671865 -0.974822
2013-01-02  1.016652 -1.274628 -0.977082 -0.731951

In [ ]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [ ]:
# Numpy 행렬에는 단 한가지의 dtype만 가능
# Pandas 데이터 프레임에는 컬럼당 한가지의 dtype만 가능
df.to_numpy()

array([[ 0.68037358,  0.51737233, -1.67186508, -0.97482208],
       [ 1.01665214, -1.27462752, -0.97708234, -0.73195097],
       [ 0.06194247, -0.76211858, -1.45483628,  0.45725156],
       [-0.71776378,  1.75401809, -0.32298288,  0.13265534],
       [ 1.12753845, -0.86188043,  1.0260142 ,  1.63672324],
       [-1.44965578,  2.06748096,  1.41277608, -0.63862213]])

In [ ]:
# 여러 dtype이 존재하는 df2를 numpy로 변환 시 모든 것을 아우르는 dtype 선택
  # DataFrame.to_numpy(): 인덱스와 컬럼명은 포함되지 않음
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [ ]:
# df의 통계 요약
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.119848  0.240041 -0.331329 -0.019794
std    1.029774  1.429780  1.293109  0.979495
min   -1.449656 -1.274628 -1.671865 -0.974822
25%   -0.522837 -0.836940 -1.335398 -0.708619
50%    0.371158 -0.122373 -0.650033 -0.252983
75%    0.932583  1.444857  0.688765  0.376103
max    1.127538  2.067481  1.412776  1.636723

In [ ]:
# df의 행과 열 바꾸기
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.680374    1.016652    0.061942   -0.717764    1.127538   -1.449656
B    0.517372   -1.274628   -0.762119    1.754018   -0.861880    2.067481
C   -1.671865   -0.977082   -1.454836   -0.322983    1.026014    1.412776
D   -0.974822   -0.731951    0.457252    0.132655    1.636723   -0.638622

In [ ]:
# 행 또는 열 값에 따라 나열하기
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.974822 -1.671865  0.517372  0.680374
2013-01-02 -0.731951 -0.977082 -1.274628  1.016652
2013-01-03  0.457252 -1.454836 -0.762119  0.061942
2013-01-04  0.132655 -0.322983  1.754018 -0.717764
2013-01-05  1.636723  1.026014 -0.861880  1.127538
2013-01-06 -0.638622  1.412776  2.067481 -1.449656

In [ ]:
df.sort_index(ascending=False)

                   A         B         C         D
2013-01-06 -1.449656  2.067481  1.412776 -0.638622
2013-01-05  1.127538 -0.861880  1.026014  1.636723
2013-01-04 -0.717764  1.754018 -0.322983  0.132655
2013-01-03  0.061942 -0.762119 -1.454836  0.457252
2013-01-02  1.016652 -1.274628 -0.977082 -0.731951
2013-01-01  0.680374  0.517372 -1.671865 -0.974822

In [ ]:
# 값에 따라 나열하기
df.sort_values(by="B")

                   A         B         C         D
2013-01-02  1.016652 -1.274628 -0.977082 -0.731951
2013-01-05  1.127538 -0.861880  1.026014  1.636723
2013-01-03  0.061942 -0.762119 -1.454836  0.457252
2013-01-01  0.680374  0.517372 -1.671865 -0.974822
2013-01-04 -0.717764  1.754018 -0.322983  0.132655
2013-01-06 -1.449656  2.067481  1.412776 -0.638622

In [ ]:
df.sort_values(by="B", ascending=False)

                   A         B         C         D
2013-01-06 -1.449656  2.067481  1.412776 -0.638622
2013-01-04 -0.717764  1.754018 -0.322983  0.132655
2013-01-01  0.680374  0.517372 -1.671865 -0.974822
2013-01-03  0.061942 -0.762119 -1.454836  0.457252
2013-01-05  1.127538 -0.861880  1.026014  1.636723
2013-01-02  1.016652 -1.274628 -0.977082 -0.731951

# 3. 데이터 선택 (Selection)
- .at / .iat
- .loc / .iloc
- .isin

In [ ]:
# 해당하는 열 가져오기
df['A']  # df.A

2013-01-01    0.680374
2013-01-02    1.016652
2013-01-03    0.061942
2013-01-04   -0.717764
2013-01-05    1.127538
2013-01-06   -1.449656
Freq: D, Name: A, dtype: float64

In [ ]:
# 해당하는 행 가져오기
df[2:4]  # df['20130103':'20130104']

                   A         B         C         D
2013-01-03  0.061942 -0.762119 -1.454836  0.457252
2013-01-04 -0.717764  1.754018 -0.322983  0.132655

## 인덱스 또는 컬럼명으로 가져오기 (.loc)

In [ ]:
# 인덱스 값으로 가져오기
df.loc['20130101']

A    0.680374
B    0.517372
C   -1.671865
D   -0.974822
Name: 2013-01-01 00:00:00, dtype: float64

In [ ]:
# 지정한 행과 열에 해당하는 값 가져오기
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.680374  0.517372
2013-01-02  1.016652 -1.274628
2013-01-03  0.061942 -0.762119
2013-01-04 -0.717764  1.754018
2013-01-05  1.127538 -0.861880
2013-01-06 -1.449656  2.067481

In [ ]:
df.loc['20130102':'20130104', 'A':'C']

                   A         B         C
2013-01-02  1.016652 -1.274628 -0.977082
2013-01-03  0.061942 -0.762119 -1.454836
2013-01-04 -0.717764  1.754018 -0.322983

In [ ]:
df.loc['20130102':'20130104', ['A','C']]

                   A         C
2013-01-02  1.016652 -0.977082
2013-01-03  0.061942 -1.454836
2013-01-04 -0.717764 -0.322983

In [ ]:
df.loc[dates[0],'A']

0.6803735791475444

In [ ]:
# .at: scalar 가져올 때 .loc 보다 더 빠른 방법
df.at[dates[0],'A']

0.6803735791475444

## 좌표값으로 가져오기 (.iloc)

In [ ]:
df.iloc[2]

A    0.061942
B   -0.762119
C   -1.454836
D    0.457252
Name: 2013-01-03 00:00:00, dtype: float64

In [ ]:
df.iloc[3:5]  # df[3:5] / df['20130104':'20130105']

                   A         B         C         D
2013-01-04 -0.717764  1.754018 -0.322983  0.132655
2013-01-05  1.127538 -0.861880  1.026014  1.636723

In [ ]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.717764  1.754018
2013-01-05  1.127538 -0.861880

In [ ]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.016652 -0.977082
2013-01-03  0.061942 -1.454836
2013-01-05  1.127538  1.026014

In [ ]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.016652 -1.274628 -0.977082 -0.731951
2013-01-03  0.061942 -0.762119 -1.454836  0.457252

In [ ]:
df.iloc[1,1]

-1.2746275156187237

In [ ]:
# .iat: scalar 가져올 때 .iloc 보다 더 빠른 방법
df.iat[1,1]

-1.2746275156187237

## 조건에 해당하는 값 가져오기 (.isin)

In [ ]:
df[df['A']>0]

                   A         B         C         D
2013-01-01  0.680374  0.517372 -1.671865 -0.974822
2013-01-02  1.016652 -1.274628 -0.977082 -0.731951
2013-01-03  0.061942 -0.762119 -1.454836  0.457252
2013-01-05  1.127538 -0.861880  1.026014  1.636723

In [ ]:
df[df>0]

                   A         B         C         D
2013-01-01  0.680374  0.517372       NaN       NaN
2013-01-02  1.016652       NaN       NaN       NaN
2013-01-03  0.061942       NaN       NaN  0.457252
2013-01-04       NaN  1.754018       NaN  0.132655
2013-01-05  1.127538       NaN  1.026014  1.636723
2013-01-06       NaN  2.067481  1.412776       NaN

In [ ]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.680374  0.517372 -1.671865 -0.974822    one
2013-01-02  1.016652 -1.274628 -0.977082 -0.731951    one
2013-01-03  0.061942 -0.762119 -1.454836  0.457252    two
2013-01-04 -0.717764  1.754018 -0.322983  0.132655  three
2013-01-05  1.127538 -0.861880  1.026014  1.636723   four
2013-01-06 -1.449656  2.067481  1.412776 -0.638622  three

In [ ]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.061942 -0.762119 -1.454836  0.457252   two
2013-01-05  1.127538 -0.861880  1.026014  1.636723  four

## 값 설정하기

In [ ]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [ ]:
df

                   A         B         C         D
2013-01-01  0.680374  0.517372 -1.671865 -0.974822
2013-01-02  1.016652 -1.274628 -0.977082 -0.731951
2013-01-03  0.061942 -0.762119 -1.454836  0.457252
2013-01-04 -0.717764  1.754018 -0.322983  0.132655
2013-01-05  1.127538 -0.861880  1.026014  1.636723
2013-01-06 -1.449656  2.067481  1.412776 -0.638622

In [ ]:
# 새로운 컬럼 추가(인덱스에 해당하는 값만 가져옴)
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01  0.680374  0.517372 -1.671865 -0.974822  NaN
2013-01-02  1.016652 -1.274628 -0.977082 -0.731951  1.0
2013-01-03  0.061942 -0.762119 -1.454836  0.457252  2.0
2013-01-04 -0.717764  1.754018 -0.322983  0.132655  3.0
2013-01-05  1.127538 -0.861880  1.026014  1.636723  4.0
2013-01-06 -1.449656  2.067481  1.412776 -0.638622  5.0

In [ ]:
# 새로운 값으로 바꾸기
df.at[dates[0],'A'] = 0
df.iat[0, 1] = 0
df.loc[:, 'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.671865  5  NaN
2013-01-02  1.016652 -1.274628 -0.977082  5  1.0
2013-01-03  0.061942 -0.762119 -1.454836  5  2.0
2013-01-04 -0.717764  1.754018 -0.322983  5  3.0
2013-01-05  1.127538 -0.861880  1.026014  5  4.0
2013-01-06 -1.449656  2.067481  1.412776  5  5.0

In [ ]:
df2 = df.copy()
df2[df2>0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.671865 -5  NaN
2013-01-02 -1.016652 -1.274628 -0.977082 -5 -1.0
2013-01-03 -0.061942 -0.762119 -1.454836 -5 -2.0
2013-01-04 -0.717764 -1.754018 -0.322983 -5 -3.0
2013-01-05 -1.127538 -0.861880 -1.026014 -5 -4.0
2013-01-06 -1.449656 -2.067481 -1.412776 -5 -5.0